Autodesk.Revit.DB.Analysis.MEPNetworkIterator.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment)
Creates an iterator to visit the connected segments on both sides.
pADoc:
The document of the analytical network.
startSegment:
The starting analytical segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025